/**
任务
时间限制： 3000MS
内存限制： 589824KB
题目描述：
有n个城市，城市从1到n进行编号。小美最初住在k号城市中。在接下来的m天里，小美每天会收到一个任务，她可以选择完成当天的任务或者放弃该任务。第i天的任务需要在ci号城市完成，如果她选择完成这个任务，若任务开始前她恰好在ci号城市，则会获得ai的收益；若她不在ci号城市，她会前往ci号城市，获得bi的收益。当天的任务她都会当天完成，任务完成后，她会留在该任务所在的ci号城市直到接受下一个任务。如果她选择放弃任务，她会停留原地，且不会获得收益。小美想知道，如果她合理地完成任务，最大能获得多少收益？



输入描述
第一行三个正整数n, m和k，表示城市数量，总天数， 初始所在城市。

第二行为m个整数c1, c2,...... cm，其中ci表示第i天的任务所在地点为ci。

第三行为m个整数a1, a2,...... am，其中ai表示完成第i天任务且地点不变的收益。

第四行为m个整数b1, b2,...... bm，其中bi表示完成第i天的任务且地点改变的收益。

1 ≤ k, ci ≤ n ≤ 30000, 1 ≤ m ≤ 30000, 0 ≤ ai, bi ≤ 109。

输出描述
输出一个整数，表示小美合理完成任务能得到的最大收益。


样例输入
3 5 1
2 1 2 3 2
9 6 2 1 7
1 3 0 5 2
样例输出
13

提示
最初小美在1号城市。

第一天选择放弃任务，留在1号城市，此时总收益为0。

第二天选择完成任务，因为任务所在地为1号城市，与小美当前城市相同，获得6的收益。任务完成后，小美在1号城市，此时总收益为6。

第三天选择完成任务，因为任务所在地与小美所在城市不同，获得0的收益。任务完成后，小美在2号城市，此时收益为6。

第四天放弃任务，所在城市不变，仍在2号城市，总收益不变仍为6。

第五条接受任务，因为任务所在地与小美当前城市相同，获得7的收益，总收益为13。
 */

package main

import "fmt"

func main() {
	var n,m,k int
	fmt.Scan(&n, &m, &k)
	C := make([]int, m)
	for i :=0;i<m;i++ {
		fmt.Scan(&C[i])
	}
	A := make([]int, m)
	for i :=0;i<m;i++ {
		fmt.Scan(&A[i])
	}
	B := make([]int, m)
	for i :=0;i<m;i++ {
		fmt.Scan(&B[i])
	}
	//
	ffen := make([]int, m+1)
	fwei := make([]int, m+1)
	gfen := make([]int, m+1)
	gwei := make([]int, m+1)
	fwei[0] = k
	gwei[0] = k
	for i:=1;i<=m;i++ {
		j := i-1
		//get
		if gwei[i-1] == C[j] {
			gfen[i] = max(gfen[i-1], ffen[i-1]) + C[j]
			gwei[i] = gwei[i-1]
		}else {
			gfen[i] = max(gfen[i-1], ffen[i-1]) + B[j]
			gwei[i] = C[j]
		}
		//
		if fwei[i-1] == C[j] {

		}
	}
}

func max(a, b int) int {
	if a > b {
		return a
	}
	return b
}